In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.cm as cm

In [2]:
data = pd.read_csv("https://raw.githubusercontent.com/fivethirtyeight/uber-tlc-foil-response/master/uber-trip-data/uber-raw-data-may14.csv")
data

                 Date/Time      Lat      Lon    Base
0         5/1/2014 0:02:00  40.7521 -73.9914  B02512
1         5/1/2014 0:06:00  40.6965 -73.9715  B02512
2         5/1/2014 0:15:00  40.7464 -73.9838  B02512
3         5/1/2014 0:17:00  40.7463 -74.0011  B02512
4         5/1/2014 0:17:00  40.7594 -73.9734  B02512
...                    ...      ...      ...     ...
652430  5/31/2014 23:45:00  40.7309 -74.0014  B02764
652431  5/31/2014 23:52:00  40.7528 -73.9798  B02764
652432  5/31/2014 23:55:00  40.7158 -73.9519  B02764
652433  5/31/2014 23:56:00  40.6961 -73.8997  B02764
652434  5/31/2014 23:59:00  40.7393 -73.9919  B02764

[652435 rows x 4 columns]

                 Date/Time      Lat      Lon    Base
0         5/1/2014 0:02:00  40.7521 -73.9914  B02512
1         5/1/2014 0:06:00  40.6965 -73.9715  B02512
2         5/1/2014 0:15:00  40.7464 -73.9838  B02512
3         5/1/2014 0:17:00  40.7463 -74.0011  B02512
4         5/1/2014 0:17:00  40.7594 -73.9734  B02512
...                    ...      ...      ...     ...
652430  5/31/2014 23:45:00  40.7309 -74.0014  B02764
652431  5/31/2014 23:52:00  40.7528 -73.9798  B02764
652432  5/31/2014 23:55:00  40.7158 -73.9519  B02764
652433  5/31/2014 23:56:00  40.6961 -73.8997  B02764
652434  5/31/2014 23:59:00  40.7393 -73.9919  B02764

[652435 rows x 4 columns]

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652435 entries, 0 to 652434
Data columns (total 4 columns):
Date/Time    652435 non-null object
Lat          652435 non-null float64
Lon          652435 non-null float64
Base         652435 non-null object
dtypes: float64(2), object(2)
memory usage: 19.9+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652435 entries, 0 to 652434
Data columns (total 4 columns):
Date/Time    652435 non-null object
Lat          652435 non-null float64
Lon          652435 non-null float64
Base         652435 non-null object
dtypes: float64(2), object(2)
memory usage: 19.9+ MB

# **Data preprocessing et visualisation**

In [4]:
from datetime import datetime

data['Date/Time'] = pd.to_datetime(data['Date/Time'])

data['Date'] = data['Date/Time'].apply(lambda x: datetime.date(x))
data['Time'] = data['Date/Time'].apply(lambda x: datetime.time(x))

data = data.drop(columns="Date/Time")

data.head()

       Lat      Lon    Base        Date      Time
0  40.7521 -73.9914  B02512  2014-05-01  00:02:00
1  40.6965 -73.9715  B02512  2014-05-01  00:06:00
2  40.7464 -73.9838  B02512  2014-05-01  00:15:00
3  40.7463 -74.0011  B02512  2014-05-01  00:17:00
4  40.7594 -73.9734  B02512  2014-05-01  00:17:00

       Lat      Lon    Base        Date      Time
0  40.7521 -73.9914  B02512  2014-05-01  00:02:00
1  40.6965 -73.9715  B02512  2014-05-01  00:06:00
2  40.7464 -73.9838  B02512  2014-05-01  00:15:00
3  40.7463 -74.0011  B02512  2014-05-01  00:17:00
4  40.7594 -73.9734  B02512  2014-05-01  00:17:00

In [5]:
data['Day'] = data['Date'].apply(lambda x: x.day)
data['Month'] = data['Date'].apply(lambda x: x.month)
data['Year'] = data['Date'].apply(lambda x: x.year)

data['Hour'] = data['Time'].apply(lambda x: x.hour)
data['Minute'] = data['Time'].apply(lambda x: x.minute)

data = data.drop(columns=["Date", "Time", "Base"])
data.head()

       Lat      Lon  Day  Month  Year  Hour  Minute
0  40.7521 -73.9914    1      5  2014     0       2
1  40.6965 -73.9715    1      5  2014     0       6
2  40.7464 -73.9838    1      5  2014     0      15
3  40.7463 -74.0011    1      5  2014     0      17
4  40.7594 -73.9734    1      5  2014     0      17

       Lat      Lon  Day  Month  Year  Hour  Minute
0  40.7521 -73.9914    1      5  2014     0       2
1  40.6965 -73.9715    1      5  2014     0       6
2  40.7464 -73.9838    1      5  2014     0      15
3  40.7463 -74.0011    1      5  2014     0      17
4  40.7594 -73.9734    1      5  2014     0      17

In [6]:
data.Minute = data.Minute.apply(lambda x: 0 if (x <= 8 or x > 53)
                                else 15 if 8 < x <= 23
                                else 30 if 23 < x <= 38
                                else 45)

In [ ]:
from sklearn.cluster import KMeans

model = KMeans()

distortions = []
for k in range(1, 10):
    model = KMeans(n_clusters=k)
    model.fit(data)
    distortions.append(model.inertia_)

fig = plt.figure(figsize=(7, 5))
plt.plot(range(1, 10), distortions)
plt.grid(True) 
plt.show()

In [ ]:
from sklearn.metrics import silhouette_samples, silhouette_score
from sklearn.datasets import make_blobs

X, y = make_blobs(n_samples=500,
                  n_features=2,
                  centers=4,
                  cluster_std=1,
                  center_box=(-10.0, 10.0),
                  shuffle=True,
                  random_state=1)  # For reproducibility

range_n_clusters = [2, 3, 4, 5]

for n_clusters in range_n_clusters:
    # Create a subplot with 1 row and 2 columns
    fig, (ax1, ax2) = plt.subplots(1, 2)
    fig.set_size_inches(18, 7)

    # The 1st subplot is the silhouette plot
    # The silhouette coefficient can range from -1, 1 but in this example all
    # lie within [-0.1, 1]
    ax1.set_xlim([-0.1, 1])
    # The (n_clusters+1)*10 is for inserting blank space between silhouette
    # plots of individual clusters, to demarcate them clearly.
    ax1.set_ylim([0, len(X) + (n_clusters + 1) * 10])

    # Initialize the clusterer with n_clusters value and a random generator
    # seed of 10 for reproducibility.
    clusterer = KMeans(n_clusters=n_clusters, random_state=10)
    cluster_labels = clusterer.fit_predict(X)

    # The silhouette_score gives the average value for all the samples.
    # This gives a perspective into the density and separation of the formed
    # clusters
    silhouette_avg = silhouette_score(X, cluster_labels)
    print("For n_clusters =", n_clusters,
          "The average silhouette_score is :", silhouette_avg)

    # Compute the silhouette scores for each sample
    sample_silhouette_values = silhouette_samples(X, cluster_labels)

    y_lower = 10
    for i in range(n_clusters):
        # Aggregate the silhouette scores for samples belonging to
        # cluster i, and sort them
        ith_cluster_silhouette_values = \
            sample_silhouette_values[cluster_labels == i]

        ith_cluster_silhouette_values.sort()

        size_cluster_i = ith_cluster_silhouette_values.shape[0]
        y_upper = y_lower + size_cluster_i

        color = cm.nipy_spectral(float(i) / n_clusters)
        ax1.fill_betweenx(np.arange(y_lower, y_upper),
                          0, ith_cluster_silhouette_values,
                          facecolor=color, edgecolor=color, alpha=0.7)

        # Label the silhouette plots with their cluster numbers at the middle
        ax1.text(-0.05, y_lower + 0.5 * size_cluster_i, str(i))

        # Compute the new y_lower for next plot
        y_lower = y_upper + 10  # 10 for the 0 samples

    ax1.set_title("The silhouette plot for the various clusters.")
    ax1.set_xlabel("The silhouette coefficient values")
    ax1.set_ylabel("Cluster label")

    # The vertical line for average silhouette score of all the values
    ax1.axvline(x=silhouette_avg, color="red", linestyle="--")

    ax1.set_yticks([])  # Clear the yaxis labels / ticks
    ax1.set_xticks([-0.1, 0, 0.2, 0.4, 0.6, 0.8, 1])

    # 2nd Plot showing the actual clusters formed
    colors = cm.nipy_spectral(cluster_labels.astype(float) / n_clusters)
    ax2.scatter(X[:, 0], X[:, 1], marker='.', s=30, lw=0, alpha=0.7,
                c=colors, edgecolor='k')

    # Labeling the clusters
    centers = clusterer.cluster_centers_
    # Draw white circles at cluster centers
    ax2.scatter(centers[:, 0], centers[:, 1], marker='o',
                c="white", alpha=1, s=200, edgecolor='k')

    for i, c in enumerate(centers):
        ax2.scatter(c[0], c[1], marker='$%d$' % i, alpha=1,
                    s=50, edgecolor='k')

    ax2.set_title("The visualization of the clustered data.")
    ax2.set_xlabel("Feature space for the 1st feature")
    ax2.set_ylabel("Feature space for the 2nd feature")

    plt.suptitle(("Silhouette analysis for KMeans clustering on sample data "
                  "with n_clusters = %d" % n_clusters),
                 fontsize=14, fontweight='bold')

plt.show()

In [ ]:
import folium
from folium import plugins
import geopy

map1 = folium.Map(location=[40.779897, -73.968565],
               zoom_start=11)

plugins.Fullscreen().add_to(map1)
plugins.ScrollZoomToggler().add_to(map1)

In [ ]:
#Show map types using layer control
folium.raster_layers.TileLayer('Open Street Map').add_to(map1)
folium.raster_layers.TileLayer('Stamen Terrain').add_to(map1)
folium.raster_layers.TileLayer('Stamen Toner').add_to(map1)
folium.raster_layers.TileLayer('Stamen Watercolor').add_to(map1)
folium.raster_layers.TileLayer('CartoDB Positron').add_to(map1)
folium.raster_layers.TileLayer('CartoDB Dark_Matter').add_to(map1)

#Add layer control to show different map types
folium.LayerControl().add_to(map1)

In [ ]:
map1

In [ ]:
data_gps = data.drop(columns=['Day', 'Month', 'Year', 'Hour', 'Minute'])
data_gps.head()

In [ ]:
model = KMeans(n_clusters=4)

model.fit(data_gps)

In [ ]:
centers = model.cluster_centers_

centers

In [ ]:
dict_cluster = {}
count = 1

for center in centers:
    name = str('Cluster ' + str(count))
    dict_cluster[name] = list(center)
    count += 1

dict_cluster

In [ ]:
for item in dict_cluster.items():
    folium.Marker(location=item[1], popup=item[0], icon=folium.Icon(icon='car', prefix='fa', color='red')).add_to(map1)

In [ ]:
map1

In [ ]:
data_sample = data.sample(frac=0.07, axis=0).reset_index().drop(columns='index')

data_sample

In [ ]:
data_sample.apply(lambda row: folium.Circle(radius=1, location=[row['Lat'], row['Lon']], color='blue').add_to(map1), axis=1)

In [ ]:
map1

In [ ]:
map1.save('map_uber_pickups_052014.html')

In [ ]:
heatmap = folium.Map(location=[40.779897, -73.968565],
                     zoom_start=11)

plugins.Fullscreen().add_to(heatmap)
plugins.ScrollZoomToggler().add_to(heatmap)

#Create list of coordinates for the heatmap
coord = list(data_sample.apply(lambda row: [row['Lat'], row['Lon']], axis=1))

plugins.HeatMap(data=coord, radius=10, gradient={0.5: 'blue', 0.65: 'lime', 0.95: 'red'}).add_to(heatmap)

heatmap

In [ ]:
heatmap.save('heatmap_uber_pickups_052014.html')

In [ ]:
data_sample_time = pd.read_csv("https://raw.githubusercontent.com/fivethirtyeight/uber-tlc-foil-response/master/uber-trip-data/uber-raw-data-may14.csv")

data_sample_time['Date/Time'] = pd.to_datetime(data_sample_time['Date/Time'])

data_sample_time['Date'] = data_sample_time['Date/Time'].apply(lambda x: datetime.date(x))
data_sample_time['Time'] = data_sample_time['Date/Time'].apply(lambda x: datetime.time(x))

data_sample_time = data_sample_time.drop(columns=['Date/Time', 'Base'])

In [ ]:
data_sample_time = data_sample_time.sample(frac=0.07, axis=0).sort_values(by='Date').reset_index().drop(columns='index')
data_sample_time

In [ ]:
heatmap_with_time = folium.Map(location=[40.779897, -73.968565],
                               zoom_start=11)

#Create list of coordinates for the heatmap
coord2 = list(data_sample_time.apply(lambda row: [row['Lat'], row['Lon']], axis=1))

#Create list of dates
#heatmap_dates = list(data_sample_time.apply(lambda row: row['Date'], axis=1))
dates = [d.strftime('%Y-%m-%d') for d in data_sample_time.Date]

#Create HeatMapWithTime plugin
heatmap_plugin = plugins.HeatMapWithTime(data=coord2,
                        index=dates,
                        radius=15,
                        auto_play=True,
                        max_opacity=0.3).add_to(heatmap_with_time)

heatmap_plugin.add_to(heatmap_with_time)

heatmap_with_time

In [ ]:
from datetime import timedelta
[(datetime.now() + k  * timedelta(1)).strftime('%Y-%m-%d') for k in range(len(data_sample_time))]